backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 2
      dtype: float64
      name: input_1
      ragged: false
      sparse: false
  - class_name: Lambda
    config:
      arguments: {}
      dtype: float64
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAMAAAATAAAAcxgAAABkAXwAiAAYABQAiAGIABgAGwBkAhgAUwApA07nAAAA

        AAAAAEDnAAAAAAAA8D+pACkB2gFYKQLaAmxi2gJ1YnIDAAAA+g5zY2hyb2Rpbmdlci5wedoIPGxh

        bWJkYT5EAAAA8wAAAAA=

        '
      - null
      - !!python/tuple
        - !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - &id001 !!python/name:numpy.ndarray ''
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 2
          - &id002 !!python/object/apply:numpy.dtype
            args:
            - f8
            - false
            - true
            state: !!python/tuple
            - 3
            - <
            - null
            - null
            - null
            - -1
            - -1
            - 0
          - false
          - !!binary |
            AAAAAAAAFMAAAAAAAAAAAA==
        - !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAFEAYLURU+yH5Pw==
      function_type: lambda
      module: __main__
      name: lambda
      output_shape: null
      output_shape_module: null
      output_shape_type: raw
      trainable: true
  - class_name: Dense
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config:
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 100
      use_bias: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config:
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 2
      use_bias: true
  - class_name: Dense
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config:
          seed: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 100
      use_bias: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config:
          seed: null
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 2
      use_bias: true
  - class_name: Dense
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config:
          seed: null
      kernel_regularizer: null
      name: dense_4
      trainable: true
      units: 100
      use_bias: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config:
          seed: null
      kernel_regularizer: null
      name: dense_5
      trainable: true
      units: 2
      use_bias: true
  - class_name: Dense
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config:
          seed: null
      kernel_regularizer: null
      name: dense_6
      trainable: true
      units: 100
      use_bias: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config:
          seed: null
      kernel_regularizer: null
      name: dense_7
      trainable: true
      units: 2
      use_bias: true
  name: sequential
keras_version: 2.5.0
